FemDesign.Calculate.Design
fdscript.xsd
DESIGNCALC

FemDesign.Calculate.Design.#ctor
Parameterless constructor for serialization.

FemDesign.Calculate.Design.#ctor(System.Boolean,System.Boolean,System.Boolean,System.Boolean)
autoDesign:
check:
loadCombination: True if you want the design to be based on Load Combination. False if you want the design to be based on Load Group
applyChanges: True will force FemDesign to apply the new cross sections to the model at the end of the design process.